Autodesk.Revit.UI.FilterDialog.NewFilterName
The name of the new ParameterFilterElement to be created and selected once Show is invoked.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: newFilterName is an empty string.
-or-
When setting this property: newFilterName cannot include prohibited characters.
-or-
When setting this property: The supplied filter name newFilterName is not unique.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015

Autodesk.Revit.UI.FilterDialog.#ctor(Autodesk.Revit.DB.Document,System.String)
Constructs a new instance of the FilterDialog class,
while setting the name of the new ParameterFilterElement to be created and selected for editing.
Remarks:
Show the dialog with the Show() method after setting the desired options.
doc:
The document that owns the FilterElements displayed and edited in the dialog.
name:
The user-visible name for the new ParameterFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as a filter element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015